package com.telesens.academy.lesson03.classwork03;

/*
1.
        Создать новый проект/класс.
        Создать метод createArrayDialog, который в диалоговом режиме запрашивает размер массива, все его элементы и возвращает созданный числовой массив.
        Создать метод sum, который вычисляет сумму элементов массива.
        Создать метод max, который определяет максимальный элемент.
        Создать метод countEven, который вычисляет сумму четных элементов массива.
        Создать метод printArray, который выводит массив на консоль.
        Создать метод printReport, который принимает в качестве аргументов размер массива, сумму, макс, кол-во четных элементов и выводит отчет на консоль:
        - Размер: 3
        - Сумма: 18
        - Максимальный: 10
        - Кол-во четных: 2
        Продемонстрировать работу программы (в методe main не должно быть другого кода, кроме вызовов созданных методов)
*/


public class Classwork03_01 {
    public static void main(String[] args) {

    }


}
