package com.telesens.academy.lesson02.classwork02;


/*
4.
        Объявить переменные целого типа n=5, m=3
        Вычислить значения n/m в переменную div
        Вывести n, m и div на консоль.
*/


public class Classwork02_04 {
    public static void main(String[] args) {

        int n=5;
        double m=3;

        double div = n/m;
        System.out.println("n = "+n);
        System.out.println("m = "+m);
        System.out.println("div = n/m = "+div);


    }
}
