package com.telesens.academy.lesson02.classwork02;


/*
2.
        Объявить переменную целого типа int bigInt
        Проинициализировать значением 2_147_483_647
        Прибавить к переменно bigInt 1
        Вывести результат на консоль
*/


public class Classwork02_02 {
    public static void main(String[] args) {

        int bigint = 2_147_483_647;
        System.out.println("bigint=" + bigint);
        System.out.println("Result bigint+1=" + bigint + 1);


    }
}
